* Извлечение данных из тренда

 Возвращает список аналоговых сигналов тренда trd, которые
 соответствуют списку обозначений сигналов из списка
 signal-string-list

*recoder:trd-discret-signal-list* (x trd) signal-string-list

Возвращает список дискретных сигналов тренда trd, которые
соответствуют списку обозначений сигналов из списка signal-string-list


** Извлечение аналоговых сигналов
#+begin_src lisp :var a-signals=a-signals :exports code
  (recoder/get:trd-analog-by-record recoder/trd:*trd* 1000 *a-signals*)
#+end_src

#+name: recoder-get-trd-analog-by-utime
#+begin_src lisp :var a-signals=a-signals :exports code
  (recoder/get:trd-analog-by-utime *trd* (+ (recoder/trd:utime-start *trd*) 250) *a-signals*)
#+end_src

#+name: recoder-get-trd-analog-mid-by-utime 
#+begin_src lisp :var a-signals=a-signals :exports code
  (r/get:trd-analog-mid-by-utime *trd* (+ (r/trd:utime-start *trd*) 250) *a-signals*)
#+end_src

#+name: recoder-get-trd-analog-mid-by-snames
#+begin_src lisp :var a-signals=a-signals :exports code
  (r/get:trd-analog-mid-by-snames *trd* (+ (r/trd:utime-start *trd*) 250) *s-names*)
#+end_src

Возвращает список средних значений параметров, записанных в тренде trd
в момент времени utime для списка сигналов, определяемых их именами
snames.

Осреднение происходит в интервале записей от  n-before до n-after.

#+name: recoder-get-trd-analog-stddev-by-utime
#+begin_src lisp :var a-signals=a-signals :exports code
  (recoder/get:trd-analog-stddev-by-utime recoder/trd:*trd*
                                          (+ (recoder/trd:utime-start recoder/trd:*trd*) 250)
                                          ,*a-signals*)
#+end_src

#+name: recoder-get-trd-analog-stddev-by-utime
#+begin_src lisp :var a-signals=a-signals :exports both
  (recoder/get:trd-analog-stddev-by-snames recoder/trd:*trd*
                                          (+ (recoder/trd:utime-start recoder/trd:*trd*) 250)
                                           ,*s-names*)
#+end_src

*** Пример извлечения сигналов из тренда
    
#+name: make-table
#+begin_src lisp :var a-signals=a-signals :exports both
  (defparameter *utime*
    (loop :for ut :from (recoder/trd:utime-start recoder/trd:*trd*) :to (recoder/trd:utime-end recoder/trd:*trd*)
          :by (floor (- (recoder/trd:utime-end recoder/trd:*trd*) (recoder/trd:utime-start recoder/trd:*trd*))
                     100)
          :collect ut))

  (mnas-format:round-2d-list 
    (append
     (list (mapcar #'recoder/a-signal:<a-signal>-id *a-signals*))
     (list (mapcar #'recoder/a-signal:<a-signal>-units *a-signals*))
     (mapcar
      #'(lambda (ut)
          (r/get:trd-analog-by-utime  recoder/trd:*trd* ut *a-signals*))
      ,*utime*)))
#+end_src

#+RESULTS: make-table
|     V2 |      P02 |    T2 | ET300 |
|   м3/с |       Па |    °C |    °C |
| 0.1869 | 1.079d+5 | 11.61 | 1.660 |
| 0.1858 | 1.078d+5 | 12.50 | 2.271 |
| 0.1678 | 1.074d+5 | 12.99 | 2.197 |
| 0.1427 | 1.053d+5 | 12.67 | 2.319 |
| 0.1427 | 1.053d+5 | 12.97 | 2.246 |
| 0.1396 | 1.054d+5 | 13.23 | 3.442 |
| 0.1381 | 1.056d+5 | 13.44 | 10.23 |
| 0.1335 | 1.057d+5 | 13.65 | 46.09 |
| 0.1331 | 1.061d+5 | 13.84 | 130.2 |
| 0.1255 | 1.065d+5 | 14.05 | 421.8 |
| 0.1396 | 1.055d+5 | 14.36 | 17.80 |
| 0.1385 | 1.054d+5 | 14.55 | 3.149 |
| 0.1385 | 1.054d+5 | 14.78 | 2.222 |
| 0.1385 | 1.056d+5 | 14.97 | 15.09 |
| 0.1369 | 1.058d+5 | 15.18 | 65.48 |
| 0.1259 | 1.065d+5 | 15.39 | 408.6 |
| 0.1259 | 1.066d+5 | 15.51 | 439.6 |
| 0.1228 | 1.066d+5 | 15.72 | 454.5 |
| 0.1385 | 1.055d+5 | 16.03 | 76.93 |
| 0.1385 | 1.057d+5 | 16.21 | 27.71 |
| 0.1343 | 1.058d+5 | 16.54 | 153.7 |
| 0.1209 | 1.069d+5 | 16.61 | 579.0 |
| 0.1225 | 1.069d+5 | 16.75 | 579.5 |
| 0.1328 | 1.058d+5 | 16.89 | 186.8 |
| 0.1457 | 1.059d+5 | 17.46 | 18.73 |
| 0.1511 | 1.060d+5 | 17.74 | 4.395 |
| 0.1526 | 1.059d+5 | 18.05 | 2.417 |
| 0.1526 | 1.059d+5 | 18.26 | 2.393 |
| 0.1511 | 1.062d+5 | 18.44 | 17.11 |
| 0.1347 | 1.074d+5 | 18.70 | 482.8 |
| 0.1526 | 1.061d+5 | 18.85 | 50.39 |
| 0.1530 | 1.059d+5 | 19.10 | 6.275 |
| 0.1541 | 1.060d+5 | 19.36 | 2.759 |
| 0.1236 | 1.084d+5 | 19.39 | 802.8 |
| 0.1484 | 1.063d+5 | 19.48 | 178.8 |
| 0.1526 | 1.060d+5 | 19.83 | 17.31 |
| 0.1514 | 1.062d+5 | 20.14 | 21.02 |
| 0.1366 | 1.075d+5 | 20.32 | 469.0 |
| 0.1350 | 1.074d+5 | 20.37 | 520.2 |
| 0.1366 | 1.075d+5 | 20.63 | 482.4 |
| 0.1530 | 1.061d+5 | 21.01 | 45.56 |
| 0.1541 | 1.060d+5 | 21.12 | 7.276 |
| 0.1545 | 1.059d+5 | 21.41 | 3.247 |
| 0.1530 | 1.060d+5 | 21.54 | 2.710 |
| 0.1545 | 1.059d+5 | 21.83 | 2.466 |
| 0.1549 | 1.059d+5 | 22.08 | 2.515 |
| 0.1549 | 1.059d+5 | 22.23 | 2.515 |
| 0.1549 | 1.059d+5 | 22.42 | 2.661 |
| 0.1522 | 1.059d+5 | 22.60 | 2.539 |
| 0.1534 | 1.061d+5 | 22.89 | 15.01 |
| 0.1492 | 1.063d+5 | 22.98 | 57.33 |
| 0.1369 | 1.075d+5 | 23.24 | 477.9 |
| 0.1358 | 1.074d+5 | 23.24 | 496.0 |
| 0.1373 | 1.075d+5 | 23.43 | 494.8 |
| 0.1389 | 1.073d+5 | 23.56 | 420.4 |
| 0.1537 | 1.061d+5 | 23.92 | 24.98 |
| 0.1507 | 1.065d+5 | 24.20 | 97.95 |
| 0.1446 | 1.070d+5 | 24.27 | 222.2 |
| 0.1373 | 1.074d+5 | 24.48 | 449.7 |
| 0.1553 | 1.061d+5 | 24.72 | 31.10 |
| 0.1686 | 1.067d+5 | 25.04 | 6.372 |
| 0.2018 | 1.087d+5 | 25.42 | 3.711 |
| 0.1957 | 1.086d+5 | 25.45 | 3.003 |
| 0.2010 | 1.087d+5 | 25.89 | 2.905 |
| 0.1957 | 1.089d+5 | 25.96 | 26.68 |
| 0.1946 | 1.090d+5 | 26.20 | 47.10 |
| 0.1907 | 1.094d+5 | 26.39 | 98.93 |
| 0.1637 | 1.106d+5 | 26.48 | 564.5 |
| 0.1987 | 1.088d+5 | 26.62 | 23.24 |
| 0.1968 | 1.090d+5 | 26.86 | 34.03 |
| 0.1686 | 1.107d+5 | 26.97 | 568.7 |
| 0.1675 | 1.107d+5 | 27.09 | 572.3 |
| 0.1991 | 1.087d+5 | 27.26 | 28.88 |
| 0.2014 | 1.087d+5 | 27.44 | 6.079 |
| 0.2007 | 1.086d+5 | 27.65 | 3.784 |
| 0.2026 | 1.087d+5 | 27.82 | 3.467 |
| 0.2007 | 1.088d+5 | 28.03 | 15.45 |
| 0.1949 | 1.092d+5 | 28.15 | 73.05 |
| 0.1915 | 1.095d+5 | 28.31 | 116.7 |
| 0.1690 | 1.106d+5 | 28.24 | 506.4 |
| 0.1690 | 1.106d+5 | 28.38 | 532.1 |
| 0.1957 | 1.087d+5 | 28.62 | 35.25 |
| 0.2029 | 1.087d+5 | 28.81 | 7.056 |
| 0.1991 | 1.085d+5 | 28.95 | 4.175 |
| 0.2022 | 1.086d+5 | 29.11 | 3.711 |
| 0.1953 | 1.092d+5 | 29.37 | 71.97 |
| 0.1644 | 1.106d+5 | 29.21 | 561.9 |
| 0.1637 | 1.105d+5 | 29.18 | 551.5 |
| 0.1709 | 1.105d+5 | 29.48 | 517.2 |
| 0.2033 | 1.088d+5 | 29.72 | 21.85 |
| 0.1984 | 1.087d+5 | 29.96 | 6.250 |
| 0.1968 | 1.091d+5 | 30.05 | 57.94 |
| 0.1946 | 1.091d+5 | 30.10 | 103.7 |
| 0.1923 | 1.093d+5 | 30.24 | 117.0 |
| 0.1820 | 1.097d+5 | 30.29 | 255.5 |
| 0.1682 | 1.107d+5 | 30.43 | 552.8 |
| 0.1671 | 1.106d+5 | 30.33 | 579.4 |
| 0.1686 | 1.107d+5 | 30.50 | 565.1 |
| 0.2502 | 1.126d+5 | 31.50 | 41.11 |
| 0.3681 | 1.261d+5 | 35.08 | 7.349 |
| 0.4974 | 1.576d+5 | 34.98 | 5.054 |

** Извлечение дискретных сигналов
*recoder:trd-discret-by-rec-number*       (trd trd) rec-number d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи с номером rec-number тренда trd в виде 0 или 1.

*recoder:trd-discret-by-rec-number-t-nil* (trd trd) rec-number d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи с номером rec-number тренда trd в виде NIL или T.

*recoder:trd-discret-by-utime*            (trd trd) utime      d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи соответствующей времени utime тренда trd в виде 0 или 1.

*recoder:trd-discret-by-utime-t-nil*      (trd trd) utime      d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи соответствующей времени utime тренда trd в виде NIL или T.

** Примеры использования

#+BEGIN_SRC lisp :results output
  recoder/trd:*trd*
#+END_SRC

*** ORG
#+name:recoder-org-header
#+begin_src lisp :exports code
  (recoder/org:header recoder/trd:*trd*)
#+end_src

#+name:recoder-org-analog-signals
#+begin_src lisp :exports code
  (recoder/org:a-signals recoder/trd:*trd*)
#+end_src

#+name:recoder-org-discret-signals
#+begin_src lisp :exports code
  (recoder/org:d-signals recoder/trd:*trd*)
#+end_src





